[
    {
      "scenario_id": "cardiologia_01",
      "title": "Consulta de cardiología",
      "description": "Conversación real entre médico y paciente sobre hipertensión y dolor torácico",
      "context": "Consulta externa de cardiología",
      "participants": ["Doctor", "Paciente"],
      "language": "es",
      "domain": "medical",
      "dialogue": [
        {"speaker": "Doctor", "text": "Buenos días, pase y siéntese. ¿Qué le trae hoy a la consulta de cardiología?"},
        {"speaker": "Paciente", "text": "Buenos días, doctor. Me derivó mi médico de cabecera porque llevo la tensión alta y últimamente he tenido un par de episodios de dolor en el pecho."},
        {"speaker": "Doctor", "text": "Entiendo. Vamos a hablar de esos dolores. ¿Cuándo empezaron y cómo los describe?"},
        {"speaker": "Paciente", "text": "Pues desde hace unas tres semanas. Me da como una presión en el pecho cuando subo escaleras o camino deprisa. Me dura unos minutos y luego se me pasa."},
        {"speaker": "Doctor", "text": "¿Ese dolor se acompaña de falta de aire, sudoración o mareo?"},
        {"speaker": "Paciente", "text": "Sí, un poco de falta de aire, pero nada más."},
        {"speaker": "Doctor", "text": "¿El dolor cede cuando se detiene o se sienta?"},
        {"speaker": "Paciente", "text": "Sí, al parar mejora."},
        {"speaker": "Doctor", "text": "Bien. Eso es importante. Ahora, respecto a la tensión: ¿Sabe qué cifras ha tenido últimamente?"},
        {"speaker": "Paciente", "text": "En el centro de salud me la tomaron varias veces y siempre estaba sobre 155/95 más o menos."},
        {"speaker": "Doctor", "text": "Vale. ¿Está tomando alguna medicación actualmente?"},
        {"speaker": "Paciente", "text": "Solo paracetamol cuando me duele algo, pero para la tensión no me dieron nada todavía."},
        {"speaker": "Doctor", "text": "De acuerdo. ¿Tiene antecedentes familiares de infarto, angina o ictus?"},
        {"speaker": "Paciente", "text": "Sí, mi padre tuvo un infarto a los 60 años."},
        {"speaker": "Doctor", "text": "¿Fuma o ha fumado?"},
        {"speaker": "Paciente", "text": "Fumé de joven, pero lo dejé hace diez años."},
        {"speaker": "Doctor", "text": "Perfecto. ¿Y el colesterol o la glucosa se los han mirado?"},
        {"speaker": "Paciente", "text": "El médico me dijo que el colesterol estaba un poco alto, pero no me dio medicación."},
        {"speaker": "Doctor", "text": "Bien. Le comento: por lo que me cuenta, podría tratarse de angina de esfuerzo, es decir, dolor torácico al hacer actividad porque al corazón le cuesta recibir suficiente oxígeno. No es algo para alarmarse en este momento, pero sí debemos estudiarlo y tratar la hipertensión."},
        {"speaker": "Paciente", "text": "Ya… me asusta un poco, la verdad."},
        {"speaker": "Doctor", "text": "Es normal. Lo primero es pedirle una prueba de esfuerzo y un electrocardiograma, además de una analítica completa con perfil lipídico. Mientras tanto, vamos a iniciar tratamiento."},
        {"speaker": "Paciente", "text": "De acuerdo."},
        {"speaker": "Doctor", "text": "Le voy a recetar un antihipertensivo: enalapril 10 mg, un comprimido por la mañana y otro por la noche. Además, por los episodios de dolor, le indicaré un antianginoso de inicio, como nitroglicerina sublingual 0,5 mg, solo en caso de dolor torácico, colocándola bajo la lengua y esperando sentado hasta que ceda."},
        {"speaker": "Paciente", "text": "Vale. ¿Eso lo tengo que tomar todos los días?"},
        {"speaker": "Doctor", "text": "No, la nitroglicerina solo cuando aparezca el dolor. El enalapril sí será diario. Y dependiendo de los resultados de la analítica quizá añadamos un hipolipemiante, como atorvastatina, pero eso lo decidiremos con los análisis en la mano."},
        {"speaker": "Paciente", "text": "Entiendo."},
        {"speaker": "Doctor", "text": "Es fundamental también cambiar algunos hábitos: bajar el consumo de sal, hacer ejercicio moderado al menos 30 minutos al día, controlar el peso y evitar grasas saturadas. ¿Cómo lleva la alimentación?"},
        {"speaker": "Paciente", "text": "Bastante normal, aunque suelo comer embutidos y quesos."},
        {"speaker": "Doctor", "text": "Habrá que reducirlos. Le daré un folleto con la dieta recomendada para hipertensión."},
        {"speaker": "Paciente", "text": "Perfecto."},
        {"speaker": "Doctor", "text": "Y muy importante: si el dolor aparece en reposo, dura más de 10 minutos o se acompaña de dificultad para respirar intensa, debe acudir inmediatamente a urgencias."},
        {"speaker": "Paciente", "text": "Sí, lo tendré en cuenta."},
        {"speaker": "Doctor", "text": "Bien, entonces quedamos en iniciar el tratamiento con enalapril 10 mg cada 12 horas, nitroglicerina sublingual solo en caso de dolor, analítica y pruebas. Nos veremos en un mes para valorar resultados."},
        {"speaker": "Paciente", "text": "De acuerdo, muchas gracias doctor."},
        {"speaker": "Doctor", "text": "A usted, cuídese mucho y no dude en acudir antes si nota empeoramiento."}
      ]
    }
  ]
  